Revit 2027 API
IExportContextBase.OnText Method
 This method is called when a text annotation object is being output.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnText(
	TextNode node
)
Sub OnText (
	node As TextNode
)
void OnText(
	TextNode^ node
)
abstract OnText :
        node : TextNode -> unit
Parameters
node TextNode
 An output node that represents a text annotation.
See Also
Reference
IExportContextBase Interface
Autodesk.Revit.DB Namespace